Inline Mermaid diagrams, add diagram .pngs
